import numpy as np

# 7. Створіть вектор зі значеннями від 10 до 49 (★☆☆)
a = np.arange(10, 50)
print(f"7. {a}")

# 8. Розверніть вектор (перший елемент стає останнім) (★☆☆)
a1 = a[::-1]
print(f"8. {a1}")

# 9. Створіть матрицю 3x3 зі значеннями від 0 до 8 (★☆☆)
b = np.arange(9).reshape(3, 3)
print(f"9. {b}")

# 10. Знайдіть індекси ненульових елементів у списку [1,2,0,0,4,0] (★☆☆)
a2 = np.array([1, 2, 0, 0, 4, 0])
r = []
for i, x in enumerate(a2):
    if x != 0:
        r.append(i)
r = np.nonzero(a2)
print(f"10. {r[0].tolist()}")

# 11. Створіть одиничну матрицю 3x3 (★☆☆)
b1 = np.ones((3, 3))
print(f"11. {b1}")

# 12. Створіть масив розміром 3x3x3 з випадковими значеннями (★☆☆)
b3 = np.random.randint(-100, 100, (3, 3, 3))
print(f"12. {b3}")

# 13. Створіть масив розміром 10x10 з випадковими значеннями і знайдіть мінімальне та максимальне значення (★☆☆)
b4 = np.random.randint(-100, 100, (10, 10))
print(f"13. {b4}, max = {np.max(b4)}, min = {np.min(b4)}")

# 14. Створіть випадковий вектор розміром 30 і знайдіть середнє значення (★☆☆)
np.random.seed(42)
X = np.random.random_sample((30))
print(f"14. {X}, average = {np.average(X)}")

# 15. Створіть двовимірний масив з одиницями на межі та нулями всередині (★☆☆)
y = np.ones((5, 5))
y[1:-1, 1:-1] = 0
print(f"15. {y}")

# 18. Створіть матрицю 5x5 зі значеннями 1,2,3,4 під діагоналлю (★☆☆)
b5 = np.diag(np.arange(1, 5), k=-1)
print(f"18. {b5}")
